src/config/InformationRegisters/ДатыЗапретаРедактированияБанковскихИКассовыхОперацийОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ДатыЗапретаРедактированияБанковскихИКассовыхОперацийОрганизаций</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗапрета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/InformationRegisters/ДатыЗапретаРедактированияБанковскихИКассовыхОперацийОрганизаций/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Процедура УстановитьДатуЗапретаРедактирования(Параметры, АдресХранилища) Экспорт
	
	ТаблицаОрганизаций = мммСервер.ПолучитьТаблицуСерверов(ТекущаяДата(), Параметры.Организации);
	Для Каждого Организация Из ТаблицаОрганизаций Цикл
		СоединениеУстановлено = Ложь;
		Для сч = 1 По 3 Цикл
			Попытка
				Прокси = мммСервер.ПолучитьПрокси(Организация.Сервер, 
					Организация.База,
					Организация.Пользователь,
					Организация.Пароль
				);
				СоединениеУстановлено = Истина;
				Прервать;
			Исключение
				ЗаписьЖурналаРегистрации("Установка даты запрета редактирования", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
		Если НЕ СоединениеУстановлено Тогда
			Продолжить;
		КонецЕсли;
		
		ВыполняемыйКод = СтрШаблон("Константы.MMMservice_ДатаЗапретаРедактированияБанковскихИКассовыхОпераций.Установить(%1,%2,%3);"
			, Формат(Год(Параметры.ДатаЗапрета), "ЧГ=")
			, Формат(Месяц(Параметры.ДатаЗапрета), "ЧГ=")
			, Формат(День(Параметры.ДатаЗапрета), "ЧГ=")
		);
		
		Ответ = Прокси.RunCode();
		
		Если НЕ Ответ.Ошибка Тогда
			Менеджер = РегистрыСведений.ДатыЗапретаРедактированияБанковскихИКассовыхОперацийОрганизаций.СоздатьМенеджерЗаписи();
			Менеджер.Период = ТекущаяДатаСеанса();
			Менеджер.Организация = Организация;
			Менеджер.ДатаЗапрета = Параметры.ДатаЗапрета;
			Менеджер.Записать();
		Иначе
			ЗаписьЖурналаРегистрации("Установка даты запрета редактирования", УровеньЖурналаРегистрации.Ошибка,,, "По организации "+Организация+Символы.ПС+Ответ.ОписаниеОшибки);
		КонецЕсли;

	КонецЦикла;
		
	ПоместитьВоВременноеХранилище(Неопределено, АдресХранилища);
КонецПроцедуры

#КонецЕсли
